{
    "scores":
    {
        "npPoints":
        {
            "description": "NI Box checked with points on first trip",
            "events": [],
            "long": "The NI box indicates 'no initial trip', indicating that the jammer never completed their initial trip through the pack.  If points are recorded then this box should not be checked. (This error should not be raised for a correctly recorded initial pass lap point.)"
        },
        "noPointsNoNI":
        {
            "description": "No points (including a zero) on first trip, NI box not checked.",
            "events": [],
            "long": "If the jammer completes their initial pass, they should have points recorded for the first scoring trip, even if that number is zero."
        },
        "tooManyLead":
        {
            "description": "Lead box checked more than once in a single jam",
            "events": [],
            "long": "Only one jammer can be declared lead per jam.  This will check teammates during a star pass as well as opponents."
        },
        "tooManyCall":
        {
            "description": "Call box checked more than once in a single jam",
            "events": [],
            "long": "At most one jammer can call the jam off per jam."
        },
        "injuryOnlyOnce":
        {
            "description": "Injury box checked for one team, but not the other.",
            "events": [],
            "long": "If the jam is called for injury, it should be recorded on both score sheets."
        },
        "leadPenaltyNotLost":
        {
            "description": "Jammer with lead and penalty without 'lost' checked.",
            "events": [],
            "long": "If the lead jammer earns a penalty, they lose lead.  This box should be checked even if they successfully call the jam."
        },
        "onlyOneStarPass":
        {
            "description": "Star pass on only one team of the score sheet.",
            "events": [],
            "long": "If one team passes the star, the scorekeeper for the other team should record SP* on their score sheet."
        },
        "badJamNumber":
        {
            "description": "Jam number out of sequence",
            "events": [],
            "long": "Jams should occur in numerical order without gaps in the numbering."
        },
        "spPointsBothJammers":
        {
            "description": "Both jammers in a star pass with points in same trip.",
            "events": [],
            "long": "In one jam, only one jammer should score points for a trip. If Jammer A has points in trip 2 and passes the star to Jammer B in trip 3, all of the points for trip 3 should be in the trip 3 column for Jammer B."
        },
        "blankTrip":
        {
            "description": "Skipped column on score sheet.",
            "events": [],
            "long": "There shouldn't be any blank spaces in the middle of a jam.  A zero should be entered if a jammer completes a scoring pass without scoring any points."
        },
        "spStarWithJammer":
        {
            "description": "Jammer entered after SP*.",
            "events": [],
            "long": "After an SP*, indicating a star pass for the opposing team only, the remainder of the line should be blank."
        },
        "pointsNoLeadNoLost":
        {
            "description": "Points scored with no lead jammer and without lost for scoring team",
            "events": [],
            "long": "For a jammer to reach a scoring trip, it must always be the case that they are lead, their opponent is lead, or they have lost lead."
        }

    },
    "penalties":
    {
        "foUnder7":
        {
            "description": "FO entered for a skater with fewer than 7 penalties",
            "events": [],
            "long": "Skaters should not foul out with fewer than 7 penalties in regulation play."
        },
        "sevenWithoutFO":
        {
            "description": "Seven or more penalties without a FO entered",
            "events": [],
            "long": "Once a skater has earned seven penalties, an 'FO' and the jam in which she fouled out should be recorded in their last column on the penalty tracking sheet."
        },
        "expulsionNoPenalty":
        {
            "description": "Expulsion entered for a jam with no penalty",
            "events": [],
            "long": "Expulsions should always be matched to a penalty issued in the same jam with the same code."
        },
        "penaltyNoLineup":
        {
            "description": "Skater with penalty entered not listed on Lineups Tab",
            "events": [],
            "long": "A skater was listed as having a penalty in a jam where they were not listed as skating on the Lineups tab.  In the extremely rare case of a penalty incurred by a skater or bench staff not participating in the jam, ignore this error."
        },
        "penaltyNoEntry":
        {
            "description": "Penalty on penalty sheet without box entry on Lineups Tab",
            "events": [],
            "long": "A skater was listed as having a penalty without a corresponding box entry code on the Lineups tab.  Can occasionally indicate a substitution. (See warnings)"
        },
        "penaltyBadJam":
        {
            "description": "Penalty entered for an impossible jam (greater than the highest jam on the Score Tab, or prior to jam 1)",
            "events": [],
            "long": "A penalty was entered with a jam number higher than the maximum jam on the score sheet."
        },
        "codeNoJam":
        {
            "description": "Penalty code without jam number, or jam number without penalty.",
            "events": [],
            "long": "On the penalty sheet, either a penalty code was entered without a jam number, or a jam number was entered without a penalty code."
        }
    },
    "lineups":
    {
        "samePlayerTwice":
        {
            "description": "Same player entered more than once in the same jam",
            "events": [],
            "long": "The same skater was entered twice for the same jam.  As all skaters are required to have unique numbers, this indicates either an error or a time travel paradox."
        },
        "xNoPenalty":
        {
            "description": "X marked for player with no corresponding penalty",
            "events": [],
            "long": "A player was notated as entering (or continuing in) the box without a penalty marked for the same or prior jam on the penalty sheet."
        },
        "slashNoPenalty":
        {
            "description": "/ marked for player with no corresponding penalty",
            "events": [],
            "long": "A player was marked as entering the box without a penalty in the same or prior jam on the penalty sheet."
        },
        "sNoPenalty":
        {
            "description": "S marked for player with no penalty in current or prior jam.",
            "events": [],
            "long": "A player was marked as starting in the box without a penalty in the current or prior jam.  Could potentially indicate a substitute. (See warnings)"
        },
        "sSlashNoPenalty":
        {
            "description": "$ marked for player with no penalty in current or prior jam",
            "events": [],
            "long": "A player was marked as starting and finishing in the box without a penalty in the current or prior jam.  Could potentially indicate a substitute. (See warnings)"
        },
        "iNotInBox":
        {
            "description": "I or | marked for player with no box entry.",
            "events": [],
            "long": "A player was marked as continuing in the box without a corresponding box entry in a prior jam."
        },
        "seatedNoCode":
        {
            "description": "Skater previously seated in box with no code on present line.",
            "events": [],
            "long": "A skater, previously seated in the box, does not have an X or I marked to indicate that they continued in the box. Could potentially indicate a substitute. (See warnings)"
        },
        "startsWhileThere":
        {
            "description": "S or $ entered for skater already in the box.",
            "events": [],
            "long": "Skaters who have already been seated in the box should be indicated with I or X.  S and $ are reserved for skaters who report to the box between jams."
        },
        "seatedNotLinedUp":
        {
            "description": "Penalzied skater not on lineup.",
            "events": [],
            "long": "A skater who was issued a penalty in a prior jam does not appear in the lineup for this jam.  May also indicate a substitution."
        },
        "starPassNoPivot":
        {
            "description": "No Pivot box not checked on line with Star Pass",
            "events": [],
            "long": "After a star pass, the 'no pivot' box should be checked to indicate that there is no longer a pivot on the team with the pass."
        }

    },
    "warnings":
    {
        "missingData":
        {
            "description": "IGRF missing the following information:",
            "events": [],
            "long": "One or more pieces of general information about the game are missing."
        },
        "possibleSub":
        {
            "description": "Reported errors may actually be substitution.",
            "events": [],
            "long": "Checks for several sets of conditions that may indicate that the reported errors are in fact a box substitution.  Since substitutions are not indicated in the StatsBook file, check the paperwork for handwritten notes."
        },
        "lastJamNoEntry":
        {
            "description": "No box entry listed for skater penalized in final jam.",
            "events": [],
            "long": "Skaters penalized in the last jam sometimes fail to report to the box, and this is not necessarily an error in the paperwork."
        },
        "SPNoPointsNoNI": 
        {
            "description": "No points and no NI entered - star pass after initial or error?",
            "events": [],
            "long": "If a jammer passes the star in their first scoring trip, then having neither points nor the NI box is correct."
        },
        "lostNoPenalty":
        {
            "description": "Lost lead checked without a corresponding penalty.",
            "events": [],
            "long": "Most of the time 'lost lead' indicates that a jammer receieved a penalty on their initial trip. However, it is possible that this is not an error."
        },
        "injNoThree":
        {
            "description": "Jam called for injury without a '3' marked on the lineups tab.",
            "events": [],
            "long": "When the jam is called for injury, usually there should be an injured skater marked with a '3' on the lineups tab."
        }
    }
}